fixture/vcr_cassettes/stripe.subscriptiontest/cancel_all.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer qr0yuBikLRa5yJkMGuEO4DNblKhEJqkw",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8qz2xUk0ppRdQv/subscriptions?limit=100"
    },
    "response": {
      "body": "{\n  \"object\": \"list\",\n  \"data\": [\n    {\n      \"id\": \"sub_8qz2mBmqPjtun2\",\n      \"object\": \"subscription\",\n      \"application_fee_percent\": null,\n      \"cancel_at_period_end\": false,\n      \"canceled_at\": null,\n      \"created\": 1469007191,\n      \"current_period_end\": 1471685591,\n      \"current_period_start\": 1469007191,\n      \"customer\": \"cus_8qz2xUk0ppRdQv\",\n      \"discount\": null,\n      \"ended_at\": null,\n      \"livemode\": false,\n      \"metadata\": {},\n      \"plan\": {\n        \"id\": \"test-create-b\",\n        \"object\": \"plan\",\n        \"amount\": 100,\n        \"created\": 1469007191,\n        \"currency\": \"usd\",\n        \"interval\": \"month\",\n        \"interval_count\": 1,\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Test Plan test-create-b\",\n        \"statement_descriptor\": null,\n        \"trial_period_days\": null\n      },\n      \"quantity\": 1,\n      \"start\": 1469007191,\n      \"status\": \"active\",\n      \"tax_percent\": null,\n      \"trial_end\": null,\n      \"trial_start\": null\n    },\n    {\n      \"id\": \"sub_8qz2HCIukEXhLt\",\n      \"object\": \"subscription\",\n      \"application_fee_percent\": null,\n      \"cancel_at_period_end\": false,\n      \"canceled_at\": null,\n      \"created\": 1469007190,\n      \"current_period_end\": 1471685590,\n      \"current_period_start\": 1469007190,\n      \"customer\": \"cus_8qz2xUk0ppRdQv\",\n      \"discount\": null,\n      \"ended_at\": null,\n      \"livemode\": false,\n      \"metadata\": {},\n      \"plan\": {\n        \"id\": \"test-create-a\",\n        \"object\": \"plan\",\n        \"amount\": 100,\n        \"created\": 1469007189,\n        \"currency\": \"usd\",\n        \"interval\": \"month\",\n        \"interval_count\": 1,\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Test Plan test-create-a\",\n        \"statement_descriptor\": null,\n        \"trial_period_days\": null\n      },\n      \"quantity\": 1,\n      \"start\": 1469007190,\n      \"status\": \"active\",\n      \"tax_percent\": null,\n      \"trial_end\": null,\n      \"trial_start\": null\n    },\n    {\n      \"id\": \"sub_8qz2x0iNHUw71q\",\n      \"object\": \"subscription\",\n      \"application_fee_percent\": null,\n      \"cancel_at_period_end\": true,\n      \"canceled_at\": 1469007195,\n      \"created\": 1469007186,\n      \"current_period_end\": 1471685586,\n      \"current_period_start\": 1469007186,\n      \"customer\": \"cus_8qz2xUk0ppRdQv\",\n      \"discount\": null,\n      \"ended_at\": null,\n      \"livemode\": false,\n      \"metadata\": {},\n      \"plan\": {\n        \"id\": \"test-dla\",\n        \"object\": \"plan\",\n        \"amount\": 100,\n        \"created\": 1469007184,\n        \"currency\": \"usd\",\n        \"interval\": \"month\",\n        \"interval_count\": 1,\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Test Plan test-dla\",\n        \"statement_descriptor\": null,\n        \"trial_period_days\": null\n      },\n      \"quantity\": 1,\n      \"start\": 1469007186,\n      \"status\": \"active\",\n      \"tax_percent\": null,\n      \"trial_end\": null,\n      \"trial_start\": null\n    }\n  ],\n  \"has_more\": false,\n  \"url\": \"/v1/customers/cus_8qz2xUk0ppRdQv/subscriptions\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 09:33:16 GMT",
        "Content-Type": "application/json",
        "Content-Length": "3015",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8qz2tEzS3lBiAq",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer qr0yuBikLRa5yJkMGuEO4DNblKhEJqkw",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "delete",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8qz2xUk0ppRdQv/subscriptions/sub_8qz2mBmqPjtun2"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_8qz2mBmqPjtun2\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\": 1469007196,\n  \"created\": 1469007191,\n  \"current_period_end\": 1471685591,\n  \"current_period_start\": 1469007191,\n  \"customer\": \"cus_8qz2xUk0ppRdQv\",\n  \"discount\": null,\n  \"ended_at\": 1469007196,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-create-b\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1469007191,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan test-create-b\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1469007191,\n  \"status\": \"canceled\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 09:33:16 GMT",
        "Content-Type": "application/json",
        "Content-Length": "840",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8qz2sxTFDnwuj8",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer qr0yuBikLRa5yJkMGuEO4DNblKhEJqkw",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "delete",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8qz2xUk0ppRdQv/subscriptions/sub_8qz2HCIukEXhLt"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_8qz2HCIukEXhLt\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\": 1469007197,\n  \"created\": 1469007190,\n  \"current_period_end\": 1471685590,\n  \"current_period_start\": 1469007190,\n  \"customer\": \"cus_8qz2xUk0ppRdQv\",\n  \"discount\": null,\n  \"ended_at\": 1469007197,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-create-a\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1469007189,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan test-create-a\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1469007190,\n  \"status\": \"canceled\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 09:33:17 GMT",
        "Content-Type": "application/json",
        "Content-Length": "840",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8qz218Buk24nqX",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer qr0yuBikLRa5yJkMGuEO4DNblKhEJqkw",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "delete",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8qz2xUk0ppRdQv/subscriptions/sub_8qz2x0iNHUw71q"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_8qz2x0iNHUw71q\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": true,\n  \"canceled_at\": 1469007195,\n  \"created\": 1469007186,\n  \"current_period_end\": 1471685586,\n  \"current_period_start\": 1469007186,\n  \"customer\": \"cus_8qz2xUk0ppRdQv\",\n  \"discount\": null,\n  \"ended_at\": 1469007197,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-dla\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1469007184,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan test-dla\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1469007186,\n  \"status\": \"canceled\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 09:33:17 GMT",
        "Content-Type": "application/json",
        "Content-Length": "829",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8qz2y7Nx4aPm06",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer qr0yuBikLRa5yJkMGuEO4DNblKhEJqkw",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8qz2xUk0ppRdQv/subscriptions?include[]=total_count&limit=0"
    },
    "response": {
      "body": "{\n  \"object\": \"list\",\n  \"data\": [],\n  \"has_more\": false,\n  \"total_count\": 0,\n  \"url\": \"/v1/customers/cus_8qz2xUk0ppRdQv/subscriptions\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 09:33:18 GMT",
        "Content-Type": "application/json",
        "Content-Length": "137",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8qz20avaMVxwje",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]