fixture/vcr_cassettes/stripe.subscriptiontest/cancel_with_key.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer qr0yuBikLRa5yJkMGuEO4DNblKhEJqkw",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "delete",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8qz2xUk0ppRdQv/subscriptions/sub_8qz24vKKxT8NyN"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_8qz24vKKxT8NyN\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\": 1469007195,\n  \"created\": 1469007186,\n  \"current_period_end\": 1471685586,\n  \"current_period_start\": 1469007186,\n  \"customer\": \"cus_8qz2xUk0ppRdQv\",\n  \"discount\": null,\n  \"ended_at\": 1469007195,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-dlz\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1469007184,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan test-dlz\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1469007193,\n  \"status\": \"canceled\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 09:33:15 GMT",
        "Content-Type": "application/json",
        "Content-Length": "830",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8qz2XXufZvwfA8",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]