fixture/vcr_cassettes/stripe.subscriptiontest/create_with_key_with_opts.json

[
  {
    "request": {
      "body": "currency=USD&id=test-create-b&name=Test+Plan+test-create-b&amount=100&interval=month",
      "headers": {
        "Authorization": "Bearer qr0yuBikLRa5yJkMGuEO4DNblKhEJqkw",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/plans"
    },
    "response": {
      "body": "{\n  \"id\": \"test-create-b\",\n  \"object\": \"plan\",\n  \"amount\": 100,\n  \"created\": 1468968575,\n  \"currency\": \"usd\",\n  \"interval\": \"month\",\n  \"interval_count\": 1,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"name\": \"Test Plan test-create-b\",\n  \"statement_descriptor\": null,\n  \"trial_period_days\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Tue, 19 Jul 2016 22:49:35 GMT",
        "Content-Type": "application/json",
        "Content-Length": "294",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8qofhMv65vRWwG",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "plan=test-create-b",
      "headers": {
        "Authorization": "Bearer qr0yuBikLRa5yJkMGuEO4DNblKhEJqkw",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8qofBeYqzLk4FR/subscriptions"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_8qofkwfa6fHDKw\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\": null,\n  \"created\": 1468968576,\n  \"current_period_end\": 1471646976,\n  \"current_period_start\": 1468968576,\n  \"customer\": \"cus_8qofBeYqzLk4FR\",\n  \"discount\": null,\n  \"ended_at\": null,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-create-b\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1468968575,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan test-create-b\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1468968576,\n  \"status\": \"active\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Tue, 19 Jul 2016 22:49:36 GMT",
        "Content-Type": "application/json",
        "Content-Length": "826",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8qofWSxsh8qYLT",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]