fixture/vcr_cassettes/subscription_test/cancel_all.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions?limit=100"
    },
    "response": {
      "body": "{\n  \"object\": \"list\",\n  \"data\": [\n    {\n      \"id\": \"sub_8r2iYzqVytV0vI\",\n      \"object\": \"subscription\",\n      \"application_fee_percent\": null,\n      \"cancel_at_period_end\": false,\n      \"canceled_at\": null,\n      \"created\": 1469020862,\n      \"current_period_end\": 1471699262,\n      \"current_period_start\": 1469020862,\n      \"customer\": \"cus_8r2iLZ3me9G4hU\",\n      \"discount\": null,\n      \"ended_at\": null,\n      \"livemode\": false,\n      \"metadata\": {},\n      \"plan\": {\n        \"id\": \"test-create-b\",\n        \"object\": \"plan\",\n        \"amount\": 100,\n        \"created\": 1469020862,\n        \"currency\": \"usd\",\n        \"interval\": \"month\",\n        \"interval_count\": 1,\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Test Plan test-create-b\",\n        \"statement_descriptor\": null,\n        \"trial_period_days\": null\n      },\n      \"quantity\": 1,\n      \"start\": 1469020862,\n      \"status\": \"active\",\n      \"tax_percent\": null,\n      \"trial_end\": null,\n      \"trial_start\": null\n    },\n    {\n      \"id\": \"sub_8r2iMXQdNBHtDH\",\n      \"object\": \"subscription\",\n      \"application_fee_percent\": null,\n      \"cancel_at_period_end\": false,\n      \"canceled_at\": null,\n      \"created\": 1469020861,\n      \"current_period_end\": 1471699261,\n      \"current_period_start\": 1469020861,\n      \"customer\": \"cus_8r2iLZ3me9G4hU\",\n      \"discount\": null,\n      \"ended_at\": null,\n      \"livemode\": false,\n      \"metadata\": {},\n      \"plan\": {\n        \"id\": \"test-create-a\",\n        \"object\": \"plan\",\n        \"amount\": 100,\n        \"created\": 1469020859,\n        \"currency\": \"usd\",\n        \"interval\": \"month\",\n        \"interval_count\": 1,\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Test Plan test-create-a\",\n        \"statement_descriptor\": null,\n        \"trial_period_days\": null\n      },\n      \"quantity\": 1,\n      \"start\": 1469020861,\n      \"status\": \"active\",\n      \"tax_percent\": null,\n      \"trial_end\": null,\n      \"trial_start\": null\n    },\n    {\n      \"id\": \"sub_8r2ilCV6c8bo4J\",\n      \"object\": \"subscription\",\n      \"application_fee_percent\": null,\n      \"cancel_at_period_end\": true,\n      \"canceled_at\": 1469020866,\n      \"created\": 1469020856,\n      \"current_period_end\": 1471699256,\n      \"current_period_start\": 1469020856,\n      \"customer\": \"cus_8r2iLZ3me9G4hU\",\n      \"discount\": null,\n      \"ended_at\": null,\n      \"livemode\": false,\n      \"metadata\": {},\n      \"plan\": {\n        \"id\": \"test-dla\",\n        \"object\": \"plan\",\n        \"amount\": 100,\n        \"created\": 1469020853,\n        \"currency\": \"usd\",\n        \"interval\": \"month\",\n        \"interval_count\": 1,\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Test Plan test-dla\",\n        \"statement_descriptor\": null,\n        \"trial_period_days\": null\n      },\n      \"quantity\": 1,\n      \"start\": 1469020856,\n      \"status\": \"active\",\n      \"tax_percent\": null,\n      \"trial_end\": null,\n      \"trial_start\": null\n    }\n  ],\n  \"has_more\": false,\n  \"url\": \"/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:21:07 GMT",
        "Content-Type": "application/json",
        "Content-Length": "3015",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2iUM0pSd1W8k",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "delete",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions/sub_8r2iYzqVytV0vI"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_8r2iYzqVytV0vI\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\": 1469020867,\n  \"created\": 1469020862,\n  \"current_period_end\": 1471699262,\n  \"current_period_start\": 1469020862,\n  \"customer\": \"cus_8r2iLZ3me9G4hU\",\n  \"discount\": null,\n  \"ended_at\": 1469020867,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-create-b\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1469020862,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan test-create-b\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1469020862,\n  \"status\": \"canceled\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:21:07 GMT",
        "Content-Type": "application/json",
        "Content-Length": "840",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2iKYtwHm2cIa",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "delete",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions/sub_8r2iMXQdNBHtDH"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_8r2iMXQdNBHtDH\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\": 1469020868,\n  \"created\": 1469020861,\n  \"current_period_end\": 1471699261,\n  \"current_period_start\": 1469020861,\n  \"customer\": \"cus_8r2iLZ3me9G4hU\",\n  \"discount\": null,\n  \"ended_at\": 1469020868,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-create-a\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1469020859,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan test-create-a\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1469020861,\n  \"status\": \"canceled\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:21:08 GMT",
        "Content-Type": "application/json",
        "Content-Length": "840",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2i4D3UI3rnVw",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "delete",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions/sub_8r2ilCV6c8bo4J"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_8r2ilCV6c8bo4J\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": true,\n  \"canceled_at\": 1469020866,\n  \"created\": 1469020856,\n  \"current_period_end\": 1471699256,\n  \"current_period_start\": 1469020856,\n  \"customer\": \"cus_8r2iLZ3me9G4hU\",\n  \"discount\": null,\n  \"ended_at\": 1469020868,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-dla\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1469020853,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan test-dla\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1469020856,\n  \"status\": \"canceled\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:21:08 GMT",
        "Content-Type": "application/json",
        "Content-Length": "829",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2imdYFD3Lonb",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions?include[]=total_count&limit=0"
    },
    "response": {
      "body": "{\n  \"object\": \"list\",\n  \"data\": [],\n  \"has_more\": false,\n  \"total_count\": 0,\n  \"url\": \"/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:21:08 GMT",
        "Content-Type": "application/json",
        "Content-Length": "137",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2iNpQOUMqNsU",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
