fixture/vcr_cassettes/subscription_test/cancel_all_with_key.json

[
  {
    "request": {
      "body": "plan=test-cancel-all",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_8r2iZnMssUU1wx\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\": null,\n  \"created\": 1469020869,\n  \"current_period_end\": 1471699269,\n  \"current_period_start\": 1469020869,\n  \"customer\": \"cus_8r2iLZ3me9G4hU\",\n  \"discount\": null,\n  \"ended_at\": null,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-cancel-all\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1469020852,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan test-cancel-all\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1469020869,\n  \"status\": \"active\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:21:09 GMT",
        "Content-Type": "application/json",
        "Content-Length": "830",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2iEVnKC1R9by",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions?limit=100"
    },
    "response": {
      "body": "{\n  \"object\": \"list\",\n  \"data\": [\n    {\n      \"id\": \"sub_8r2iZnMssUU1wx\",\n      \"object\": \"subscription\",\n      \"application_fee_percent\": null,\n      \"cancel_at_period_end\": false,\n      \"canceled_at\": null,\n      \"created\": 1469020869,\n      \"current_period_end\": 1471699269,\n      \"current_period_start\": 1469020869,\n      \"customer\": \"cus_8r2iLZ3me9G4hU\",\n      \"discount\": null,\n      \"ended_at\": null,\n      \"livemode\": false,\n      \"metadata\": {},\n      \"plan\": {\n        \"id\": \"test-cancel-all\",\n        \"object\": \"plan\",\n        \"amount\": 100,\n        \"created\": 1469020852,\n        \"currency\": \"usd\",\n        \"interval\": \"month\",\n        \"interval_count\": 1,\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Test Plan test-cancel-all\",\n        \"statement_descriptor\": null,\n        \"trial_period_days\": null\n      },\n      \"quantity\": 1,\n      \"start\": 1469020869,\n      \"status\": \"active\",\n      \"tax_percent\": null,\n      \"trial_end\": null,\n      \"trial_start\": null\n    }\n  ],\n  \"has_more\": false,\n  \"url\": \"/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:21:10 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1090",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2iShnv1aq2Xn",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "delete",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions/sub_8r2iZnMssUU1wx"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_8r2iZnMssUU1wx\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\": 1469020870,\n  \"created\": 1469020869,\n  \"current_period_end\": 1471699269,\n  \"current_period_start\": 1469020869,\n  \"customer\": \"cus_8r2iLZ3me9G4hU\",\n  \"discount\": null,\n  \"ended_at\": 1469020870,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-cancel-all\",\n    \"object\": \"plan\",\n    \"amount\": 100,\n    \"created\": 1469020852,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan test-cancel-all\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1469020869,\n  \"status\": \"canceled\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:21:10 GMT",
        "Content-Type": "application/json",
        "Content-Length": "844",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2igjPnvyPRWZ",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions?include[]=total_count&limit=0"
    },
    "response": {
      "body": "{\n  \"object\": \"list\",\n  \"data\": [],\n  \"has_more\": false,\n  \"total_count\": 0,\n  \"url\": \"/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 20 Jul 2016 13:21:10 GMT",
        "Content-Type": "application/json",
        "Content-Length": "137",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8r2iYUvpYFcbym",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
