fixture/vcr_cassettes/subscription_test/change_payment_source.json

[
  {
    "request": {
      "body": "source[object]=card&source[number]=4012888888881881&source[exp_year]=20&source[exp_month]=12",
      "headers": {
        "Authorization": "Bearer non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Stripe/v1 stripity-stripe/1.4.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/customers/cus_8r2iLZ3me9G4hU/subscriptions/sub_8r2iF6CbPVjGK2"
    },
    "response": {
      "body": "{\n  \"id\": \"sub_8wa4ZIjzdoQM8G\",\n  \"object\": \"subscription\",\n  \"application_fee_percent\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\": null,\n  \"created\": 1470298140,\n  \"current_period_end\": 1472976540,\n  \"current_period_start\": 1470298140,\n  \"customer\": \"cus_8wa4DQwaaN9iA2\",\n  \"discount\": null,\n  \"ended_at\": null,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"plan\": {\n    \"id\": \"test-dlx\",\n    \"object\": \"plan\",\n    \"amount\": 1000,\n    \"created\": 1470297878,\n    \"currency\": \"usd\",\n    \"interval\": \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Test Plan Deluxe\",\n    \"statement_descriptor\": null,\n    \"trial_period_days\": null\n  },\n  \"quantity\": 1,\n  \"start\": 1470298140,\n  \"status\": \"active\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Thu, 04 Aug 2016 08:09:02 GMT",
        "Content-Type": "application/json",
        "Content-Length": "815",
        "Connection": "keep-alive",
        "Access-Control-Allow-Credentials": "true",
        "Access-Control-Allow-Methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "Access-Control-Allow-Origin": "*",
        "Access-Control-Max-Age": "300",
        "Cache-Control": "no-cache, no-store",
        "Request-Id": "req_8wa4jw9nFNYM5z",
        "Stripe-Version": "2016-07-06",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
